### Loading the required libs

In [1]:
import os

In [2]:
pip install pandas numpy matplotlib

Requirement already satisfied: pandas in c:\logiciels\python311\lib\site-packages (2.1.1)
Requirement already satisfied: numpy in c:\logiciels\python311\lib\site-packages (1.26.0)
Requirement already satisfied: matplotlib in c:\logiciels\python311\lib\site-packages (3.8.0)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\37718890\appdata\roaming\python\python311\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\logiciels\python311\lib\site-packages (from pandas) (2023.3.post1)
Requirement already satisfied: tzdata>=2022.1 in c:\logiciels\python311\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: contourpy>=1.0.1 in c:\logiciels\python311\lib\site-packages (from matplotlib) (1.1.1)
Requirement already satisfied: cycler>=0.10 in c:\logiciels\python311\lib\site-packages (from matplotlib) (0.12.1)
Requirement already satisfied: fonttools>=4.22.0 in c:\logiciels\python311\lib\site-packages (from matplotlib) (4.43.1)
Requirement already satisfied: kiwisolver>=1.0.1 in c:\logiciels\python311\lib\site-packages (from matplotlib) (1.4.5)
Requirement already satisfied: packaging>=20.0 in c:\users\37718890\appdata\roaming\python\python311\site-packages (from matplotlib) (23.2)
Requirement already satisfied: pillow>=6.2.0 in c:\logiciels\python311\lib\site-packages (from matplotlib) (10.0.1)
Requirement already satisfied: pyparsing>=2.3.1 in c:\logiciels\python311\lib\site-packages (from matplotlib) (3.1.1)
Requirement already satisfied: six>=1.5 in c:\users\37718890\appdata\roaming\python\python311\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 23.1.2 -> 23.2.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [3]:
import pandas as pd

In [4]:
import numpy as np

In [5]:
import matplotlib.pyplot as plt

### Set your work directory to where the data is located

In [6]:
os.chdir("C://Users//37718890//Downloads/ml-100k/")

In [7]:
os.getcwd()

'C:\\Users\\37718890\\Downloads\\ml-100k'

### Column headers for the dataset

In [8]:
data_cols = ['user id', 'movie id', 'rating', 'timestamp']

item_cols = ['movie id', 'movie title', 'release date',
'video release date', 'IMDb URL', 'unknown', 'Action',
'Adventure', 'Animation', 'Childrens', 'Comedy', 'Crime',
'Documentary', 'Drama', 'Fantasy', 'Film-Noir', 'Horror',
'Musical', 'Mystery', 'Romance', 'Sci-Fi', 'Thriller', 'War', 'Western']

user_cols = ['user id', 'age', 'gender', 'occupation', 'zip code']

### Importing the data files onto dataframes

In [9]:
users = pd.read_csv('u.user', sep= '|', names=user_cols, encoding= 'latin-1')

item = pd.read_csv('u.item', sep='|', names=item_cols, encoding='latin-1')

data = pd.read_csv('u.data', sep='\t', names=data_cols, encoding='latin-1')

In [10]:
users.head()

   user id  age gender  occupation zip code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067
3        4   24      M  technician    43537
4        5   33      F       other    15213

In [11]:
item.head()

,movie id,movie title,release date,video release date,IMDb URL,unknown,Action,Adventure,Animation,Childrens,...,Fantasy,Film-Noir,Horror,Musical,Mystery,Romance,Sci-Fi,Thriller,War,Western
0,1,Toy Story (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Toy%20Story%2...,0,0,0,1,1,...,0,0,0,0,0,0,0,0,0,0
1,2,GoldenEye (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?GoldenEye%20(...,0,1,1,0,0,...,0,0,0,0,0,0,0,1,0,0
2,3,Four Rooms (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Four%20Rooms%...,0,0,0,0,0,...,0,0,0,0,0,0,0,1,0,0
3,4,Get Shorty (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Get%20Shorty%...,0,1,0,0,0,...,0,0,0,0,0,0,0,0,0,0
4,5,Copycat (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Copycat%20(1995),0,0,0,0,0,...,0,0,0,0,0,0,0,1,0,0

In [12]:
data.head()

   user id  movie id  rating  timestamp
0      196       242       3  881250949
1      186       302       3  891717742
2       22       377       1  878887116
3      244        51       2  880606923
4      166       346       1  886397596

In [13]:
print(users.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 943 entries, 0 to 942
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   user id     943 non-null    int64
 1   age         943 non-null    int64
 2   gender      943 non-null    object
 3   occupation  943 non-null    object
 4   zip code    943 non-null    object
dtypes: int64(2), object(3)
memory usage: 37.0+ KB
None

In [14]:
print(item.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1682 entries, 0 to 1681
Data columns (total 24 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   movie id            1682 non-null   int64
 1   movie title         1682 non-null   object
 2   release date        1681 non-null   object
 3   video release date  0 non-null      float64
 4   IMDb URL            1679 non-null   object
 5   unknown             1682 non-null   int64
 6   Action              1682 non-null   int64
 7   Adventure           1682 non-null   int64
 8   Animation           1682 non-null   int64
 9   Childrens           1682 non-null   int64
 10  Comedy              1682 non-null   int64
 11  Crime               1682 non-null   int64
 12  Documentary         1682 non-null   int64
 13  Drama               1682 non-null   int64
 14  Fantasy             1682 non-null   int64
 15  Film-Noir           1682 non-null   int64
 16  Horror              1682 non-null   int64
 17  Musical             1682 non-null   int64
 18  Mystery             1682 non-null   int64
 19  Romance             1682 non-null   int64
 20  Sci-Fi              1682 non-null   int64
 21  Thriller            1682 non-null   int64
 22  War                 1682 non-null   int64
 23  Western             1682 non-null   int64
dtypes: float64(1), int64(20), object(3)
memory usage: 315.5+ KB
None

In [15]:
print(data.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100000 entries, 0 to 99999
Data columns (total 4 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   user id    100000 non-null  int64
 1   movie id   100000 non-null  int64
 2   rating     100000 non-null  int64
 3   timestamp  100000 non-null  int64
dtypes: int64(4)
memory usage: 3.1 MB
None

### Create a merged dataframe

In [16]:
df = pd.merge(pd.merge(item, data), users)

print(df.head)

<bound method NDFrame.head of        movie id                 movie title release date  video release date  \
0             1            Toy Story (1995)  01-Jan-1995                 NaN
1             4           Get Shorty (1995)  01-Jan-1995                 NaN
2             5              Copycat (1995)  01-Jan-1995                 NaN
3             7       Twelve Monkeys (1995)  01-Jan-1995                 NaN
4             8                 Babe (1995)  01-Jan-1995                 NaN
...         ...                         ...          ...                 ...
99995       748           Saint, The (1997)  14-Mar-1997                 NaN
99996       751  Tomorrow Never Dies (1997)  01-Jan-1997                 NaN
99997       879      Peacemaker, The (1997)  01-Jan-1997                 NaN
99998       894         Home Alone 3 (1997)  01-Jan-1997                 NaN
99999       901            Mr. Magoo (1997)  25-Dec-1997                 NaN

                                                IMDb URL  unknown  Action  \
0      http://us.imdb.com/M/title-exact?Toy%20Story%2...        0       0
1      http://us.imdb.com/M/title-exact?Get%20Shorty%...        0       1
2      http://us.imdb.com/M/title-exact?Copycat%20(1995)        0       0
3      http://us.imdb.com/M/title-exact?Twelve%20Monk...        0       0
4         http://us.imdb.com/M/title-exact?Babe%20(1995)        0       0
...                                                  ...      ...     ...
99995  http://us.imdb.com/M/title-exact?Saint%2C%20Th...        0       1
99996  http://us.imdb.com/M/title-exact?imdb-title-12...        0       1
99997  http://us.imdb.com/M/title-exact?Peacemaker%2C...        0       1
99998  http://us.imdb.com/M/title-exact?imdb-title-11...        0       0
99999  http://us.imdb.com/M/title-exact?imdb-title-11...        0       0

       Adventure  Animation  Childrens  ...  Thriller  War  Western  user id  \
0              0          1          1  ...         0    0        0      308
1              0          0          0  ...         0    0        0      308
2              0          0          0  ...         1    0        0      308
3              0          0          0  ...         0    0        0      308
4              0          0          1  ...         0    0        0      308
...          ...        ...        ...  ...       ...  ...      ...      ...
99995          0          0          0  ...         1    0        0      729
99996          0          0          0  ...         1    0        0      729
99997          0          0          0  ...         1    1        0      729
99998          0          0          1  ...         0    0        0      729
99999          0          0          0  ...         0    0        0      729

       rating  timestamp  age  gender  occupation  zip code
0           4  887736532   60       M     retired     95076
1           5  887737890   60       M     retired     95076
2           4  887739608   60       M     retired     95076
3           4  887738847   60       M     retired     95076
4           5  887736696   60       M     retired     95076
...       ...        ...  ...     ...         ...       ...
99995       4  893286638   19       M     student     56567
99996       3  893286338   19       M     student     56567
99997       3  893286299   19       M     student     56567
99998       1  893286511   19       M     student     56567
99999       1  893286491   19       M     student     56567

[100000 rows x 31 columns]>

### Group Movies by their title

In [17]:
ratings_total = df.groupby('movie title').size()

print(ratings_total)

movie title
'Til There Was You (1997)                  9
1-900 (1994)                               5
101 Dalmatians (1996)                    109
12 Angry Men (1957)                      125
187 (1997)                                41
                                        ...
Young Guns II (1990)                      44
Young Poisoner's Handbook, The (1995)     41
Zeus and Roxanne (1997)                    6
unknown                                    9
Á köldum klaka (Cold Fever) (1994)         1
Length: 1664, dtype: int64

### Take the mean ratings of each movie using the mean function

In [18]:
ratings_mean = df.groupby('movie title').mean('rating').reset_index()[['movie title', 'rating']]

print(ratings_mean.head())

                 movie title    rating
0  'Til There Was You (1997)  2.333333
1               1-900 (1994)  2.600000
2      101 Dalmatians (1996)  2.908257
3        12 Angry Men (1957)  4.344000
4                 187 (1997)  3.024390

In [19]:
ratings_mean

                                movie title    rating
0                 'Til There Was You (1997)  2.333333
1                              1-900 (1994)  2.600000
2                     101 Dalmatians (1996)  2.908257
3                       12 Angry Men (1957)  4.344000
4                                187 (1997)  3.024390
...                                     ...       ...
1659                   Young Guns II (1990)  2.772727
1660  Young Poisoner's Handbook, The (1995)  3.341463
1661                Zeus and Roxanne (1997)  2.166667
1662                                unknown  3.444444
1663     Á köldum klaka (Cold Fever) (1994)  3.000000

[1664 rows x 2 columns]

### Modidfy the dataframes so that we can merge the two

In [20]:
ratings_total = pd.DataFrame({'Movie title': ratings_total.index, 'total ratings': ratings_total.values})

In [21]:
ratings_total

                                Movie title  total ratings
0                 'Til There Was You (1997)              9
1                              1-900 (1994)              5
2                     101 Dalmatians (1996)            109
3                       12 Angry Men (1957)            125
4                                187 (1997)             41
...                                     ...            ...
1659                   Young Guns II (1990)             44
1660  Young Poisoner's Handbook, The (1995)             41
1661                Zeus and Roxanne (1997)              6
1662                                unknown              9
1663     Á köldum klaka (Cold Fever) (1994)              1

[1664 rows x 2 columns]

### Now we sort the values by the total rating

In [23]:
final = pd.merge(ratings_mean, ratings_total, left_on='movie title', right_on='Movie title').sort_values(by = 'total ratings', ascending = False)

ratings_mean['movie title'] = ratings_mean.index

print(final.describe())

            rating  total ratings
count  1664.000000    1664.000000
mean      3.077018      60.096154
std       0.780418      80.956484
min       1.000000       1.000000
25%       2.665094       7.000000
50%       3.162132      27.000000
75%       3.651808      80.250000
max       5.000000     583.000000